{
  "users": [
    {
      "email": "kolya@gmail.com",
      "password": "$2a$10$W0t6BAdBWpOn3xBievI21u9qJ87Zw4DdDzpxyPhA1sNOcwZmOnwwu",
      "name": "Kolya",
      "id": 0
    },
    {
      "email": "andrii@gmail.com",
      "password": "$2a$10$xqkOI6inbbMwbmPJOWyUOOnGrVU1z.QpUJilwTFGyt1u48kZ5CBwm",
      "name": "Andrii",
      "id": 1
    },
    {
      "email": "oleg@gmail.com",
      "password": "$2a$10$mnQKz0H4V2fGmJOKYbJTFucg0lRtBmVXe2YRqLrCafGDgjLmfOmxa",
      "name": "Oleg",
      "id": 2
    }
  ],
  "pets": [
    {
      "id": 0,
      "name": "Mulya",
      "petType": "cat",
      "breed": "none",
      "weight": "5",
      "years": "5",
      "setInfo": "big",
      "userId": 0
    },
    {
      "id": 2,
      "name": "Tyson",
      "petType": "dog",
      "breed": "none",
      "weight": "30",
      "years": "5",
      "setInfo": "big",
      "userId": 0
    },
    {
      "name": "Nemo",
      "petType": "fish",
      "breed": "",
      "weight": "1",
      "years": "",
      "setInfo": "big",
      "userId": "1",
      "id": 3
    },
    {
      "id": 4,
      "name": "Doris",
      "petType": "fish",
      "breed": "",
      "weight": "1",
      "years": "",
      "setInfo": "big",
      "userId": 1
    },
    {
      "name": "GoGo",
      "petType": "cat",
      "breed": "",
      "weight": "5",
      "years": "3",
      "setInfo": "big",
      "userId": "2",
      "id": 5
    },
    {
      "name": "Nemo",
      "petType": "fish",
      "breed": "",
      "weight": "1",
      "years": "1",
      "setInfo": "big",
      "userId": "0",
      "id": 6
    }
  ],
  "items": [
    {
      "id": 1,
      "title": "Корм Adult Cat Sterilised Turkey With Oat — індичка та овес",
      "body": "Optimeal Adult Cat Sterilised Turkey With Oat Повнораціонний сухий корм для стерилізованих кішок та кастрованих котів – індичка та овес. Зберігає сечовидільну систему здоровою завдяки збалансованому вмісту мінеральних речовин, підтримує оптимальну вагу завдяки L-карнітину, зміцнює імунітет.",
      "img": "https://images.prom.ua/3014088797_optimeal-povnoratsionnij-suhij.jpg",
      "price": 340,
      "type": 1,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 3
    },
    {
      "id": 2,
      "title": "Корм Club 4 Paws для дорослих кішок",
      "body": "Club 4 Paws Premium Adult Cats Sterilised Повнораціонний сухий корм для дорослих стерилізованих котів.Спеціальний комплекс для кастрованих котів та стерилізованих кішок. Сухий преміум-раціон розроблений з урахуванням потреб організму тварини після стерилізації чи кастрації. Він містить м’ясні інгредієнти на першому місці у складіз них 24% курки, яка має високий коефіцієнт перетравлюваності.",
      "img": "https://petslike.net/media/cache/sylius_shop_product_original/07/08/a03509d938ddace70d861e37cf09.png",
      "price": 300,
      "type": 1,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 6
    },
    {
      "id": 3,
      "title": "Корм Special Care Hairball Control з куркою",
      "body": "Cat Chow Special Care Hairball Control - Сухий корм з куркою для виведення ковтунів шерсті зі шлунка. Цей корм розроблений для дорослих котів (віком від 1 до 7 років) зі зниженим рівнем активності (домашніх котів). Завдяки оптимальному вмісту харчових волокон корм забезпечує профілактику утворення ковтунів шерсті (тріхобезоарів) у кишечнику і тому ідеально підходить для котів довгошерстих порід.",
      "img": "https://dogsbox.pl/userdata/public/gfx/2018.jpg",
      "price": 225,
      "type": 1,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 4
    },
    {
      "id": 4,
      "title": "Корм Brit Premium by Nature Cat Sterilized Chicken",
      "body": "Brit Premium by Nature Cat Sterilized Chicken - Повноцінний корм преміумкласу для дорослих стерилізованих котів. Смачний і апетитний корм з м’ясом курей і цінними натуральними інгредієнтами для щоденного здорового харчування вашого улюбленця.",
      "img": "https://brit-petfood.com/file/nodes/product/mainImage/BPbN_dry_adult_m.png",
      "price": 315,
      "type": 1,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 5
    },
    {
      "id": 5,
      "title": "Корм Brit Premium Adult M",
      "body": "Brit Premium Adult M - сухий корм для дорослих собак середніх порід. Повнораціонний сухий корм для дорослих собак середніх порід. Збалансована формула, повністю забезпечує усіма необхідними поживними речовинами, вітамінами, мінералами, а також сприяє підтримці здоров`я собак середніх порід.",
      "img": "https://petslike.net/media/cache/sylius_shop_product_original/ac/26/a98e1b39c50e4554e2717fe7cf1e.jpeg",
      "price": 200,
      "type": 1,
      "petType": "dog",
      "weight": "big",
      "buyVisited": 4
    },
    {
      "id": 6,
      "title": "Корм Adult Small&Mini Chicken Cухий корм з куркою для дорослих собак",
      "body": "Purina Pro Plan Adult Small & Mini Sensitive Digestion OptiDigest Chicken - повнораціонний сухий корм для собак малих та мініатюрних порід (вага собаки до 10 кг) з чутливим травленням.",
      "img": "https://petslike.net/media/cache/sylius_shop_product_original/ac/26/a98e1b39c50e4554e2717fe7cf1e.jpeg",
      "price": 200,
      "type": 1,
      "petType": "dog",
      "weight": "small",
      "buyVisited": 2
    },
    {
      "id": 7,
      "title": "Корм Royal Canin Hypoallergenic",
      "body": "Ветеринарна дієта для собак при небажаній реакції на корм. Royal Canin Hypoallergenic - Повнораціонний дієтичний корм для собак, склад якого розроблено для зниження ознак інгредієнтної та нутрієнтної непереносимості. Відібрані джерела протеїнів і вуглеводів.",
      "img": "https://petslike.net/media/cache/sylius_shop_product_original/3b/71/dc4a2b9855e3e33762af02e4b7dd.jpeg",
      "price": 660,
      "type": 1,
      "petType": "dog",
      "weight": "small",
      "buyVisited": 1
    },
    {
      "id": 8,
      "title": "Корм Royal Canin Medium Adult",
      "body": "Royal Canin Medium Adult - Повнораціонний збалансований сухий корм для дорослих собак середніх розмірів. Допомагає підтримувати природні захисні сили організму вашого собаки, зокрема завдяки комплексу антиоксидантів та маннанолігосахаридам. Допомагає підтримувати здоров`я травної системи завдяки формулі, що містить високоперетравний білок та має збалансований вміст дієтичної клітковини.",
      "img": "https://petslike.net/media/cache/sylius_shop_product_original/3b/51/3fb3f42352c6924951ed35ac28f4.jpeg",
      "price": 840,
      "type": 1,
      "petType": "dog",
      "weight": "big",
      "buyVisited": 9
    },
    {
      "id": 9,
      "title": "Корм TetraMin для акваріумних риб",
      "body": "Щоб не ламати голову та не шукати корм, що надає активності рибам, зверніть увагу на Tetra MIN. Цей корм виготовлений компанією Тетра за допомогою новітніх технологій та методик. Він забезпечує здоров`я, активність та яскравість рибками будь-якого виду. Прекрасно впливає на рівень імунітету і допомагає боротися з різними захворюваннями. Корм випускається у вигляді пластівців, які можуть довго триматися на поверхні води та забезпечують рибам максимально комфортне та природне харчування.",
      "img": "https://masterzoo.ua/content/images/20/1100x1100l80mc0/78932334113620.webp",
      "price": 740,
      "type": 1,
      "petType": "fish",
      "weight": "normal",
      "buyVisited": 4
    },
    {
      "id": 10,
      "title": "Корм TetraMin Cichlid Sticks для акваріумних риб",
      "body": "Основний корм у вигляді паличок для всіх видів цихлід та інших великих декоративних риб – з формулою BioActive. Добавки: Вітаміни, Провітаміни та хімічні речовини з аналогічною дією: Вітамін А 30480 МО/кг, Вітамін Д3 1900 МО/кг. Комбінації мікроелементів: Е5 Марганець 69 мг/кг, Е6 Цинк 41 мг/кг, Е1 Залізо 27 мг/кг. Сполучні речовини: Бентоніт-Монтморіллоніт 5100 мг/кг. Барвники, антиоксиданти.",
      "img": "https://masterzoo.ua/content/images/42/1150x1150l80mc0/67460397581254.webp",
      "price": 820,
      "type": 1,
      "petType": "fish",
      "weight": "normal",
      "buyVisited": 5
    },
    {
      "id": 11,
      "title": "Лежак Taotaopets для котів",
      "body": "Велика кількість вовни або абсолютна її відсутність, наші домашні улюбленці, незалежно від їх розміру або породи, люблять іноді зручніше влаштуватися на теплому місці. І як добре, коли у тварини в будинку є свій особистий простір, де вихованець міг би врятуватися від холоду або відпочити після довгої прогулянки на вулиці. Плюс, щоденне чищення м`яких поверхонь від вовни, залишилося б у минулому, адже у вихованця є своє місце.",
      "img": "https://images.prom.ua/3687684048_w640_h640_3687684048.jpg",
      "price": 650,
      "type": 2,
      "petType": "cat",
      "weight": "normal",
      "buyVisited": 9
    },
    {
      "id": 12,
      "title": "Лежак Tooky для котів",
      "body": "Тканина – оксфорд, вологостійка та міцна тканина. Легко чиститься вологою ганчіркою чи щіткою, можна використовувати на вулиці. Наповнювач – Холофайбер",
      "img": "https://www.kmeshok.com.ua/wp-content/uploads/2021/10/podushka-dlia-sobak-ta-kotiv-sira-min.jpg",
      "price": 550,
      "type": 2,
      "petType": "cat",
      "weight": "normal",
      "buyVisited": 5
    },
    {
      "id": 13,
      "title": "Лежак Tooky для собак",
      "body": "Тканина – оксфорд, вологостійка та міцна тканина. Легко чиститься вологою ганчіркою чи щіткою, можна використовувати на вулиці. Наповнювач – Холофайбер",
      "img": "https://www.kmeshok.com.ua/wp-content/uploads/2022/02/lezhanka_dlia_sobak_i_kotiv_tooki_rohozhka_syno-rozhevyj-min.jpg",
      "price": 1800,
      "type": 2,
      "petType": "dog",
      "weight": "big",
      "buyVisited": 4
    },
    {
      "id": 14,
      "title": "Лежак Mity для собак",
      "body": "Лежак складається із бортика та з’ємної подушки. Тобто Ви можете легко витягнути подушку, зняти з неї чохол та випрати. Також Ви можете відтермінувати прання просто перевернувши подушку на іншу сторону. Нижня сторона подушки виготовлена в колір бортика. З’ємну подушку можна використовувати окремо від бортиків.",
      "img": "https://www.kmeshok.com.ua/wp-content/uploads/2022/02/lezhkanka_dlia_sobak_i_kotiv_mity_rohozhka_siro_bezhevyj_1-min.jpg",
      "price": 1100,
      "type": 2,
      "petType": "dog",
      "weight": "big",
      "buyVisited": 7
    },
    {
      "id": 15,
      "title": "Клітка Ferplast для собак",
      "body": "Клітка Ferplast DOG-INN 60 зроблена з міцного металу, має прямокутну форму, вона пристосовується до зростання цуценя завдяки вбудованій панелі, яка може бути переміщена відповідно до ваших потреб, щоб створити необхідний простір. У клітки є фронтальні та бічні двері, які дозволяють використовувати її як вдома, так і в дорозі. Двері посилені кількома точками замикання та запобіжною клямкою, щоб забезпечити максимальну надійність у будь-який час, у той час як низький поріжок дозволяє собаці легко входити та виходити. Поставляється в комплекті зі зручним піддоном із поліпропілену, який легко знімається для прибирання. Dog-Inn також дуже легко зібрати без використання будь-яких інструментів.",
      "img": "https://petmarket.ua/content/images/20/480x437l50nn0/ferplast-superior-60-kletka-dlya-sobak-67kh47kh50-sm-46857065456167.jpg",
      "price": 1650,
      "type": 2,
      "petType": "dog",
      "weight": "small",
      "buyVisited": 6
    },
    {
      "id": 16,
      "title": "Клітка Stefanplast Gulliver для собак",
      "body": "Клітка для собак Stefanplast (Стефанпласт) Gulliver 7 IATA спеціально розроблена для перевезення тварин у транспорті відповідно до міжнародних стандартів. Металеві двері оснащені спеціальним замком-заскочкою, який перешкоджає випадковому відчиненню дверей у дорозі. Додатково переноска може бути укомплектована чотирма колесами, що повертаються на 360°",
      "img": "https://sf-api.maudau.com.ua/img/600/744/resize/catalog/product/U/t/Utu835qA_2.jpg",
      "price": 4000,
      "type": 2,
      "petType": "dog",
      "weight": "small",
      "buyVisited": 4
    },
    {
      "id": 17,
      "title": "Клітка Stefanplast Gulliver для котів",
      "body": "Клітка для собак Stefanplast (Стефанпласт) Gulliver 2 спеціально розроблена для перевезення тварин у транспорті відповідно до міжнародних стандартів. Металеві двері оснащені спеціальним замком-заскочкою, який перешкоджає випадковому відчиненню дверей у дорозі. Додатково переноска може бути укомплектована чотирма колесами, що повертаються на 360°",
      "img": "https://petplus.com.ua/image/catalog/dogs/carrying/STEFANPLAST/perenoskagulliver3topfree_2.jpg",
      "price": 700,
      "type": 2,
      "petType": "cat",
      "weight": "normal",
      "buyVisited": 9
    },
    {
      "id": 18,
      "title": "Клітка Ferplast ATLAS для котів",
      "body": "Клітка Ferplast ATLAS ідеально підходить для перенесення котів. Її легко носити завдяки ручці, вона підходить, щоб перевозити своїх вихованців на більшості популярних засобах транспорту (автомобілі, поїзді, кораблі, літаку). Ця пластикова переноска випускається зі сталевими дверцятами, що мають міцне пластикове покриття і закривається зовні за допомогою засувок, щоб уникнути непотрібних випадкових відкривань під час поїздки. Вона не тільки відкривається, але й сприяє кращій циркуляції повітря та покращує огляд для вашого улюбленця. Дуже міцна завдяки своїй системі фіксації за допомогою бічних кріплень, ця переноска поставляється з бічними решітками, які також забезпечують відмінну циркуляцію повітря.",
      "img": "https://bizoon.com.ua/image/cache/catalog/brands/Ferplast/73007199IO-2-700x700.jpg",
      "price": 330,
      "type": 2,
      "petType": "cat",
      "weight": "normal",
      "buyVisited": 10
    },
    {
      "id": 19,
      "title": "Акваріум Tetra \"Silhouette\" для рибок",
      "body": "Пориньте у захоплюючу атмосферу підводних світів, де б ви не були! Нехай акваріум Tetra Silhouette з унікальним дизайном, що надихає, надасть закінчений вигляд вашому ідеальному будинку. Світлодіодне освітлення створює видовищні ефекти підводного світу, а вбудована система фільтрації забезпечує кришталево чисту воду, безпечну для риб.",
      "img": "https://masterzoo.ua/content/images/28/1100x1100l80mc0/72517958983711.webp",
      "price": 4400,
      "type": 2,
      "petType": "fish",
      "weight": "normal",
      "buyVisited": 1
    },
    {
      "id": 20,
      "title": "Акваріум «НЕОН» LED для рибок",
      "body": "Купити акваріум - чудовий вибір для прикраси будинку. Акваріум служить прекрасною декорацією, дозволяючи створити в будинку окремий світ з живими мешканцями - рибками. Купити Комплект НЕОН LED 32л Овальний - чудовий варіант для прикраси будинку та життя рибок. Акваріум зроблений з високоякісних матеріалів, що дозволить йому довго служити без проблем.",
      "img": "https://masterzoo.ua/content/images/39/1800x1800l80mc0/akvariumniy-komplekt-priroda-neon-led-40-kh-25-kh-25-sm-pryamoi-34-l-58874065934867.webp",
      "price": 1800,
      "type": 2,
      "petType": "fish",
      "weight": "normal",
      "buyVisited": 3
    },
    {
      "id": 21,
      "title": "Іграшка GREY-MOUSE для котів",
      "body": "М`яка «мишка» виготовлена з якісного штучного хутра. Вихованцям дуже подобається, що у «мишки» є вушка і хвіст, за які її можна носити або тягнути за собою, особливо радіють маленькі кошенята. Іграшка завжди викликає інтерес у тварин, не набридає і займає тривалий час.",
      "img": "https://masterzoo.ua/content/images/24/1800x1800l80mc0/70524193273081.webp",
      "price": 42,
      "type": 3,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 15
    },
    {
      "id": 22,
      "title": "Іграшка BALL для котів",
      "body": "М`який м`ячик виготовлений зі штучного хутра, прикрашений пір`ячками і припаде до смаку котам різного віку. З такою іграшкою ви можете розважати вихованця самі, а якщо немає вільного часу - підвісити м`ячик на надійну опору, і кішка із задоволенням \"полювати\" на нього сама. Шнурки з вузликами роблять іграшку ще привабливішою.",
      "img": "https://masterzoo.ua/content/images/25/700x700l80mc0/14968770913727.webp",
      "price": 34,
      "type": 3,
      "petType": "big",
      "weight": 4.5,
      "buyVisited": 7
    },
    {
      "id": 23,
      "title": "Іграшка TrixieBALL для собак",
      "body": "Конструкція м`ячика, з прорізами та м`якими шипами, розроблена спеціально для того, щоб очищати зуби собаки від нальоту та масажувати ясна. Він приємно пахне м`ятою та освіжає дихання пса. Також жування м`ячика викликає виділення слини, яка змиває залишки їжі та очищає пащу. За погодженням з ветеринаром у прорізі м`яча можна помістити зубну пасту для якіснішого очищення зубів.",
      "img": "https://masterzoo.ua/content/images/14/900x900l80mc0/63218168137968.webp",
      "price": 74,
      "type": 3,
      "petType": "dog",
      "weight": "small",
      "buyVisited": 10
    },
    {
      "id": 24,
      "title": "Іграшка TrixieBALL (Pink) для собак",
      "body": "Вирішили навчити вихованця апортуванню? Вам знадобиться ця іграшка. Усі собаки люблять м`ячики, тож вихованець обов`язково схопить цей снаряд і не відразу захоче його віддавати. Супроводжуйте відповідні дії собаки словами «Тримай», «Неси» - і дуже скоро вихованець зрозуміє, що від нього вимагається.",
      "img": "https://masterzoo.ua/content/images/25/793x793l80mc0/igrushka-dlya-sobak-trixie-myach-pletenyy-s-ruchkoy-30-sm-d55-sm-tekstil-tsveta-v-assortimente-85284684429476.webp",
      "price": 60,
      "type": 3,
      "petType": "dog",
      "weight": "big",
      "buyVisited": 8
    },
    {
      "id": 25,
      "title": "Декорація SpongeBob House для рибок",
      "body": "Декорації виготовлені з безпечної полірезини, довговічні, чудово виглядають у будь-якому акваріумі. За допомогою декорацій можна влаштувати укриття для донних та полохливих риб, а також просто прикрасити Ваш акваріум. Декорації легко чистяться і ніяк не впливають на параметри води. Декорації з полірезини підходять також для морського акваріума (якщо в них відсутні штучні рослини).",
      "img": "https://content1.rozetka.com.ua/goods/images/big/193081252.jpg",
      "price": 220,
      "type": 3,
      "petType": "fish",
      "weight": "normal",
      "buyVisited": 12
    },
    {
      "id": 26,
      "title": "Щітка-пуходерка Trixie з дерев`яною ручкою та пластиковий гребінець",
      "body": "Щітка-пуходерка з дерев`яною ручкою та пластиковий гребінець Trixie 6 см / 13 см, набір - dgs. Для делікатного догляду за шерстю і підшерстям, з дерев`яною ручкою, з хромованою основою щітки, дуже м`яка металева щетина, зі спеціальним пристроєм для очищення щітки",
      "img": "https://masterzoo.ua/content/images/50/1600x1600l80mc0/66154102662159.webp",
      "price": 100,
      "type": 4,
      "petType": "cat",
      "weight": "big",
      "buyVisited": 5
    }
  ]
}